Revit 2027 API
FabricArea.Direction Property
 The Major Direction of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Direction { get; }
Public ReadOnly Property Direction As XYZ
	Get
public:
property XYZ^ Direction {
	XYZ^ get ();
}
member Direction : XYZ with get
Property Value
XYZ
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace